{
  "topics": [
    {
      "content": "What was the last funny video you saw?"
    },
    {
      "content": "What do you do to get rid of stress?"
    },
    {
      "content": "What is something you are obsessed with?"
    },
    {
      "content": "Who is your favorite entertainer (comedian, musician, actor, etc.)?"
    },
    {
      "content": "What is your favorite way to waste time?"
    },
    {
      "content": "Do you have any pets? What are their names?"
    },
    {
      "content": "Where did you go last weekend? What did you do?"
    },
    {
      "content": "What are you going to do this weekend?"
    },
    {
      "content": "What is something that is popular now that annoys you?"
    },
    {
      "content": "What did you do on your last vacation?"
    },
    {
      "content": "What was the last time you worked incredibly hard?"
    },
    {
      "content": "Are you very active of do you prefer to just relax in your free time?"
    },
    {
      "content": "What do you do when you hang out with your friends?"
    },
    {
      "content": "Who is your oldest friend? Where did you meet them?"
    },
    {
      "content": "What's the best / worst thing about your work / school?"
    },
    {
      "content": "If you had intro music, what song would it be? Why?"
    },
    {
      "content": "What were you really into when you were a kid?"
    },
    {
      "content": "If you could have any animal as a pet, what animal would you choose?"
    },
    {
      "content": "What three words best describe you?"
    },
    {
      "content": "What would be your perfect weekend?"
    },
    {
      "content": "What do you think of tattoos? Do you have any?"
    },
    {
      "content": "What's your favorite number? Why?"
    },
    {
      "content": "What's the most useful thing you own?"
    },
    {
      "content": "Have you ever saved an animal's life? How about a person's life?"
    },
    {
      "content": "If you opened a business, what kind of business would it be?"
    },
    {
      "content": "Are you a very organized person?"
    },
    {
      "content": "Have you ever spoke in front of a large group of people? How did it go?"
    },
    {
      "content": "What is the strangest dream you have ever had?"
    },
    {
      "content": "What is a controversial opinion you have?"
    },
    {
      "content": "Who in your life brings you the most joy?"
    },
    {
      "content": "Who had the biggest impact on the person you have become?"
    },
    {
      "content": "What is the most annoying habit someone can have?"
    },
    {
      "content": "Where is the most beautiful place you have been?"
    },
    {
      "content": "Where do you spend most of your free time / day?"
    },
    {
      "content": "Who was your best friend in elementary school?"
    },
    {
      "content": "How often do you stay up past 3 a.m.?"
    },
    {
      "content": "What's your favorite season? Why?"
    },
    {
      "content": "Which is more important, a great car or a great house? Why?"
    },
    {
      "content": "What animal or insect do you wish humans could eradicate?"
    },
    {
      "content": "Where is the most beautiful place near where you live?"
    },
    {
      "content": "What do you bring with you everywhere you go?"
    },
    {
      "content": "How much time do you spend on the internet? What do you usually do?"
    },
    {
      "content": "What is the most disgusting habit some people have?"
    },
    {
      "content": "Where and when was the most amazing sunset you have ever seen?"
    },
    {
      "content": "Which recent news story is the most interesting?"
    },
    {
      "content": "Where is the worst place you have been stuck for a long time?"
    },
    {
      "content": "If you had to change your name, what would your new name be?"
    },
    {
      "content": "What is something that really annoys you but doesn't bother most people?"
    },
    {
      "content": "What word or saying from the past do you think should come back?"
    },
    {
      "content": "How should success be measured? By that measurement, who is the most successful person you know?"
    },
    {
      "content": "What is your guilty pleasure?"
    },
    {
      "content": "Was there ever an event in your life that defied explanation?"
    },
    {
      "content": "If you could learn the answer to one question about your future, what would the question be?"
    },
    {
      "content": "Has anyone ever saved your life?"
    },
    {
      "content": "What benefit do you bring to the group when you hang out with friends?"
    },
    {
      "content": "How often do you curse?"
    },
    {
      "content": "What trends did you follow when you were younger?"
    },
    {
      "content": "What do you fear is hiding in the dark?"
    },
    {
      "content": "What was the best time period of your life? What do you think will be the best time period of your entire life?"
    },
    {
      "content": "What do you do to improve your mood when you are in a bad mood?"
    },
    {
      "content": "What is the silliest fear you have?"
    },
    {
      "content": "What are some things you want to accomplish before you die?"
    },
    {
      "content": "What is the best room in your house? Why?"
    },
    {
      "content": "Who is someone who is popular now that you really like? Why do you like them so much?"
    },
    {
      "content": "Where is the best place to take a date?"
    },
    {
      "content": "What smell brings back great memories?"
    },
    {
      "content": "How often do you help others? Who do you help? How do you help?"
    },
    {
      "content": "What are you best at?"
    },
    {
      "content": "What makes you nervous?"
    },
    {
      "content": "Who, besides your parents, had the biggest impact on your life?"
    },
    {
      "content": "What weird or useless talent do you have?"
    },
    {
      "content": "What are some strange beliefs that some people have?"
    },
    {
      "content": "Who would be the worst person to be stuck in an elevator with? How about the best person to be stuck in an elevator with?"
    },
    {
      "content": "What's the funniest TV series you have seen?"
    },
    {
      "content": "Which TV show do you want your life to be like?"
    },
    {
      "content": "If you could bring back one TV show that was cancelled, which one would you bring back?"
    },
    {
      "content": "How have TV shows changed over the years?"
    },
    {
      "content": "What's the best sitcom past or present?"
    },
    {
      "content": "What's the best show currently on TV?"
    },
    {
      "content": "What do you think about game shows? Do you have a favorite one?"
    },
    {
      "content": "What's the most underrated or overrated TV show?"
    },
    {
      "content": "What do you think about reality TV? Why is it so popular?"
    },
    {
      "content": "Do you like reality TV shows? Why or why not? If so, which ones?"
    },
    {
      "content": "What will be the future of TV shows?"
    },
    {
      "content": "What was the best birthday wish or gift you've ever received?"
    },
    {
      "content": "How often do you binge watch shows?"
    },
    {
      "content": "What cartoons did you watch as a child?"
    },
    {
      "content": "What was the last movie you watched? How was it?"
    },
    {
      "content": "Do you prefer to watch movies in the theater or in the comfort of your own home?"
    },
    {
      "content": "What's the worst movie you have seen recently?"
    },
    {
      "content": "What's the strangest movie you have ever seen?"
    },
    {
      "content": "What is the most overrated movie?"
    },
    {
      "content": "What's your favorite genre of movie?"
    },
    {
      "content": "What movie scene choked you up the most?"
    },
    {
      "content": "Do you like documentaries? Why / why not?"
    },
    {
      "content": "When was the last time you went to a movie theater?"
    },
    {
      "content": "Do movies have the same power as books to change the world?"
    },
    {
      "content": "Which do you prefer? Books or movies?"
    },
    {
      "content": "Do you like horror movies? Why or why not?"
    },
    {
      "content": "What was the last book you read?"
    },
    {
      "content": "What book has had the biggest impact on your life?"
    },
    {
      "content": "What was your favorite book as a child?"
    },
    {
      "content": "Do you prefer physical books or ebooks?"
    },
    {
      "content": "What is the longest book you have read?"
    },
    {
      "content": "What was the worst book you had to read for school? How about the best book you had to read for school?"
    },
    {
      "content": "What book genres do you like to read?"
    },
    {
      "content": "Do you prefer fiction or nonfiction books?"
    },
    {
      "content": "What book has influenced you the most?"
    },
    {
      "content": "What book has had the biggest effect on the modern world?"
    },
    {
      "content": "Do you think people read more or less books now than 50 years ago?"
    },
    {
      "content": "How fast do you read?"
    },
    {
      "content": "How often do you go to the library?"
    },
    {
      "content": "Now that indie publishing has become easier, have books gotten better or worse?"
    },
    {
      "content": "What song always puts you in a good mood?"
    },
    {
      "content": "Which do you prefer, popular music or relatively unknown music?"
    },
    {
      "content": "What was the last song you listened to?"
    },
    {
      "content": "What is your favorite movie soundtrack?"
    },
    {
      "content": "Are there any songs that always bring a tear to your eye?"
    },
    {
      "content": "Do you like going to concerts? Why or why not? What was the last concert you went to?"
    },
    {
      "content": "Who was the first band or musician you were really into? Do you still like them?"
    },
    {
      "content": "Records, tapes, CDs, MP3s. Which did you grow up with? What is good and bad about each?"
    },
    {
      "content": "What bands or types of music do you listen to when you exercise?"
    },
    {
      "content": "Do you like classical music?"
    },
    {
      "content": "What's the best way to discover new music?"
    },
    {
      "content": "How has technology changed the music industry?"
    },
    {
      "content": "What are the three best apps on your phone?"
    },
    {
      "content": "What's the most addictive mobile game you have played?"
    },
    {
      "content": "An app mysteriously appears on your phone that does something amazing. What does it do?"
    },
    {
      "content": "How many apps do you have on your phone?"
    },
    {
      "content": "What is the most annoying app you have tried?"
    },
    {
      "content": "Which app seemed like magic the first time you used it?"
    },
    {
      "content": "What is the strangest app you have heard of or tried?"
    },
    {
      "content": "Which app has helped society the most? Which one has hurt society the most?"
    },
    {
      "content": "What is the most useful app on your phone?"
    },
    {
      "content": "What apps have changed your life a lot?"
    },
    {
      "content": "What do app makers do that really annoys you?"
    },
    {
      "content": "How often do you check your phone?"
    },
    {
      "content": "Do you always have to have the latest phone?"
    },
    {
      "content": "What was your first smart phone? How did you feel when you got it?"
    },
    {
      "content": "What is the most annoying thing about your phone?"
    },
    {
      "content": "What kind of case do you have for your phone? Why did you choose it?"
    },
    {
      "content": "Do you text more or call more? Why?"
    },
    {
      "content": "What will phones be like in 10 years?"
    },
    {
      "content": "Do you experience phantom vibration? (Feeling your phone vibrate even though it didn't.)"
    },
    {
      "content": "How do you feel if you accidentally leave your phone at home?"
    },
    {
      "content": "What do you wish your phone could do?"
    },
    {
      "content": "What sports do you like to watch?"
    },
    {
      "content": "Who are some of your favorite athletes?"
    },
    {
      "content": "Which sports do you like to play?"
    },
    {
      "content": "Which sport is the most exciting to watch? Which is the most boring to watch?"
    },
    {
      "content": "Do athletes deserve the high salaries they receive? Why or why not?"
    },
    {
      "content": "What is the hardest sport to excel at?"
    },
    {
      "content": "Who are the 3 greatest athletes of all time?"
    },
    {
      "content": "What defines a sport? Is fishing a sport? How about video game tournaments?"
    },
    {
      "content": "Why do you think sports are common across almost all cultures present and past?"
    },
    {
      "content": "What do you think the oldest sport still being played is?"
    },
    {
      "content": "How much time do you spend watching sports in a week?"
    },
    {
      "content": "Do you play sports video games? Which ones? Is playing the video game or sport more fun? Why?"
    },
    {
      "content": "What is the worst restaurant you have ever eaten at?"
    },
    {
      "content": "What restaurant do you eat at most?"
    },
    {
      "content": "What's the worst fast food restaurant?"
    },
    {
      "content": "What is the best restaurant in your area?"
    },
    {
      "content": "Would you eat at a restaurant that was really dirty if the food was amazing?"
    },
    {
      "content": "What kind of interior do you like a restaurant to have?"
    },
    {
      "content": "If you opened a restaurant, what kind of food would you serve?"
    },
    {
      "content": "What was your favorite restaurant when you were in university? How about when you were a child?"
    },
    {
      "content": "What is the strangest themed restaurant you have heard of?"
    },
    {
      "content": "What is the fanciest restaurant you have eaten at?"
    },
    {
      "content": "What is the most disgusting thing you have heard about that happened at a restaurant?"
    },
    {
      "content": "Have you traveled to any different countries? Which ones?"
    },
    {
      "content": "Where is the most relaxing place you have been?"
    },
    {
      "content": "Where is the most awe inspiring place you have been?"
    },
    {
      "content": "Do you prefer traveling alone or with a group?"
    },
    {
      "content": "What do you think of tour group packages?"
    },
    {
      "content": "Talk about some of the interesting people you have met while traveling."
    },
    {
      "content": "Where would you like to travel next?"
    },
    {
      "content": "What was the most over hyped place you've traveled to?"
    },
    {
      "content": "What's the best way to travel? (Plane, car, train, etc.)"
    },
    {
      "content": "What's the best thing about traveling? How about the worst thing?"
    },
    {
      "content": "How do you think traveling to a lot of different countries changes a person?"
    },
    {
      "content": "What is the longest plane trip you have taken?"
    },
    {
      "content": "What do you think of stay-cations? (Vacationing and seeing tourist attractions where you live.)"
    },
    {
      "content": "Do you prefer to go off the beaten path when you travel?"
    },
    {
      "content": "Where do you get your recommendations for what to do and where to stay when you travel?"
    },
    {
      "content": "What is the worst hotel you have stayed at? How about the best hotel?"
    },
    {
      "content": "What is your favorite piece of technology that you own?"
    },
    {
      "content": "What piece of technology is really frustrating to use?"
    },
    {
      "content": "What was the best invention of the last 50 years?"
    },
    {
      "content": "Does technology simplify life or make it more complicated?"
    },
    {
      "content": "Which emerging technology are you most excited about?"
    },
    {
      "content": "What problems will technology solve in the next 5 years? What problems will it create?"
    },
    {
      "content": "Will technology save the human race or destroy it?"
    },
    {
      "content": "What piece of technology would look like magic or a miracle to people in medieval Europe?"
    },
    {
      "content": "Can you think of any technology that has only made the world worse? How about a piece of technology that has only made the world better?"
    },
    {
      "content": "What technology from a science fiction movie would you most like to have?"
    },
    {
      "content": "What sci-fi movie or book would you like the future to be like?"
    },
    {
      "content": "What do you think the next big technological advance will be?"
    },
    {
      "content": "Do you care about fashion? What style of clothes do you usually wear?"
    },
    {
      "content": "What is the best pair of shoes you have ever owned? Why were they so good?"
    },
    {
      "content": "What is your favorite shirt?"
    },
    {
      "content": "What is the most embarrassing piece of clothing you own?"
    },
    {
      "content": "Does fashion help society in any way?"
    },
    {
      "content": "What is a fashion trend you are really glad went away?"
    },
    {
      "content": "Who do you think has the biggest impact on fashion trends: actors and actresses, musicians, fashion designers, or consumers?"
    },
    {
      "content": "What old trend is coming back these days?"
    },
    {
      "content": "If you didn't care at all what people thought of you, what clothes would you wear?"
    },
    {
      "content": "What is the most comfortable piece of clothing you own?"
    },
    {
      "content": "How do clothes change how the opposite sex views a person?"
    },
    {
      "content": "What is the craziest, most outrageous thing you want to achieve?"
    },
    {
      "content": "What are some goals you have already achieved?"
    },
    {
      "content": "What personal goals do you have?"
    },
    {
      "content": "What do you hope to achieve in your professional life?"
    },
    {
      "content": "Have your parents influenced what goals you have?"
    },
    {
      "content": "Do you usually achieve goals you set? Why or why not?"
    },
    {
      "content": "What is the best way to stay motivated and complete goals?"
    },
    {
      "content": "What are some goals you have failed to accomplish?"
    },
    {
      "content": "When do you want to retire? What do you want to do when you retire?"
    },
    {
      "content": "What are your goals for the next two years?"
    },
    {
      "content": "How have your goals changed over your life?"
    },
    {
      "content": "How much do you plan for the future?"
    },
    {
      "content": "How do you plan to make the world a better place?"
    },
    {
      "content": "What's the most refreshing thing on a hot summer day?"
    },
    {
      "content": "What's the best thing to do on a cold winter day?"
    },
    {
      "content": "Where is the nicest place you have been to in fall?"
    },
    {
      "content": "What is your favorite thing to eat or drink in winter?"
    },
    {
      "content": "Do you prefer summer or winter activities?"
    },
    {
      "content": "What do you like to do in spring?"
    },
    {
      "content": "Did your family take seasonal vacations?"
    },
    {
      "content": "Do you feel like fall and spring are getting shorter?"
    },
    {
      "content": "Which season are you most active in?"
    },
    {
      "content": "Is it better to live where there are four seasons or where one season takes up most of the year?"
    },
    {
      "content": "If you could make a holiday, what would it be like? What traditions would it have? What would people eat on your holiday?"
    },
    {
      "content": "What is the biggest holiday for your family?"
    },
    {
      "content": "Do you wish there were more or less holidays? Why?"
    },
    {
      "content": "If you had to get rid of a holiday, which would you get rid of? Why?"
    },
    {
      "content": "What is your favorite holiday?"
    },
    {
      "content": "What kinds of food do you usually eat on your favorite holiday?"
    },
    {
      "content": "Does having a day off for a holiday increase or decrease productivity at work?"
    },
    {
      "content": "What holidays have been over commercialized?"
    },
    {
      "content": "If some of the lesser known holidays were commercialized, what would the commercialization look like?"
    },
    {
      "content": "What do you know about the history of some holidays?"
    },
    {
      "content": "What are some good and bad things about the education system in your country?"
    },
    {
      "content": "What do you think of online education?"
    },
    {
      "content": "How can governments make education more efficient?"
    },
    {
      "content": "What do you think of standardized tests?"
    },
    {
      "content": "How can technology improve education? Can it hurt education?"
    },
    {
      "content": "Are bigger or small schools better?"
    },
    {
      "content": "Is teaching a skill that can be taught?"
    },
    {
      "content": "What will the future of education be?"
    },
    {
      "content": "What do you think of homeschooling?"
    },
    {
      "content": "How has the education you received changed your life?"
    },
    {
      "content": "What or who has taught you most of the information you use on a regular basis?"
    },
    {
      "content": "What is your favorite food?"
    },
    {
      "content": "Do you like spicy food? Why or why not? What is the spiciest thing you have ever eaten?"
    },
    {
      "content": "What foods do you absolutely hate?"
    },
    {
      "content": "What food do you know you shouldn't eat but can't help yourself?"
    },
    {
      "content": "Does government have a place in regulating food? To what extent should government regulate food?"
    },
    {
      "content": "When was the last time you had a food fight?"
    },
    {
      "content": "What do you get every time you go grocery shopping?"
    },
    {
      "content": "If your life was a meal, what would kind of meal would it be?"
    },
    {
      "content": "What do you think of buffets?"
    },
    {
      "content": "What would you want your last meal to be if you were on death row?"
    },
    {
      "content": "What food looks disgusting but tastes delicious?"
    },
    {
      "content": "When people make mistakes about food (especially foreign food) do you feel the need to correct them? (i.e. sushi / sashimi or stromboli / calzone)"
    },
    {
      "content": "Time freezes for everyone but you for one day. What do you do?"
    },
    {
      "content": "If you could call up anyone in the world and have a one hour conversation, who would you call?"
    },
    {
      "content": "You have to relive one day of your life forever. Which day do you choose?"
    },
    {
      "content": "If your mind was an island, what would it look like?"
    },
    {
      "content": "What flavor of ice cream do you wish existed?"
    },
    {
      "content": "What does your own personal hell look like? How about your own personal heaven?"
    },
    {
      "content": "A portal to another world opens in front of you. You don't know how long it will stay open or if you'll be able to get back after you go through. What do you do?"
    },
    {
      "content": "If you had a personal mascot, what would your mascot be?"
    },
    {
      "content": "You find a remote that can rewind, fast forward, stop and start time. What do you do with it?"
    },
    {
      "content": "If you were a king / queen, what would your throne look like?"
    },
    {
      "content": "If you were on the run from the police for a crime you didn't commit, where would you go?"
    }
  ],
  "tools": [
    {
      "title": "〜かた",
      "description": "Verb Suffix - The way which an action is perfeormed\nWith compound する verbs put a の　between the compound.",
      "example": "１）勉強しかた\n２）その人の泳ぎかたは不思議ですね　-> The way that person swims is strange, isn't it?"
    },
    {
      "title": "〜まで",
      "description": "A まで B = Till A.  Typically follows a 'change' type of verb.  A is always in the present affirmative.",
      "example": "日本語がぺらぺらにならまで，国にかえらない -> Until I become fluent in Japanese, I won't return to my country."
    },
    {
      "title": "〜ことにする",
      "description": "Another way of saying 'decide to do...'\nFollows the present short form of a verb.",
      "example": "１）車を買うことにしました -> We have decided to buy a car.\n２）ことにしている -> To do something as a regular practice."
    },
    {
      "title": "〜ても",
      "description": "A ても B = B, even if A.\nIf A clause ends with な-Adj or Noun, use 〜でも\nWorks with negative 〜て form",
      "example": "先生に聞かなくても，分かります -> Even if I don't listen to the teacher, I'll understand."
    },
    {
      "title": "Causative-Passive Sentences",
      "description": "How to say that you were made to do something.\n(Puppet) は (Puppet-Master) に (Action)\nる-Verbs -> Stem + させられる\nす-Verbs -> させられる\nう-Verbs -> あされる",
      "example": "私は肉を食べさせられた -> I was made to eat meat"
    },
    {
      "title": "〜のように／〜のような",
      "description": "A のような B = B is like/similar to A\nな is used when comparing in terms of visual attributes\nOtherwise, use 〜のように when describing actions or other characteristics",
      "example": "１）メアリさん魚のように上手に泳げる -> Mary can swim very well, like a fish\n２）私はかまくらのような町が好きです -> I like towns like Kamakura"
    },
    {
      "title": "〜のに",
      "description": "B, despite A\nSimilar mechanics to 〜ので\nA and B must be factual statements",
      "example": "家にいるのに，電話に出ない -> Even though she is home, she does not answer the phone."
    },
    {
      "title": "〜ば",
      "description": "Forms 'If A, then B' type sentences\nJust add the 〜えば ending（食べる -> 食べれば）\nNegative: ない -> なければ\nImplies a good result for B",
      "example": "歩けば，電車に遅れちゃう -> If I walk, I'll be late for the train."
    },
    {
      "title": "Stem + なさい",
      "description": "Command.  Implies a kind of talking down to, or 'I know better'.",
      "example": "１）毎日家に電話をかけなさい -> Be sure to call home everday\n２）文句を言うのを止めなさい -> Stop complaining"
    },
    {
      "title": "Causative Sentences",
      "description": "Make someone do something/let someone do something.\n(Director) は (Cast) に (Action)\nWhen followed by あげる／くねる, always means 'let'",
      "example": "親はお姉さんに買い物に行かせた -> My parents made my sister go shopping."
    },
    {
      "title": "〜あいだに",
      "description": "'While' something else takes place.\nFirst clause is typically in 〜ている form.\nFirst clause can be a noun, just use 〜のあいだに",
      "example": "お風呂に入っている間に電話がありました -> There was a phone call while I was taking a bath."
    },
    {
      "title": "〜てほしい",
      "description": "私は (person) に Verb + てほしい\nCan negate with 〜ないでほしい or ほしくない\nIf speaking of another person's wants, use ほしがっている",
      "example": "私はお父さんに昔話をして欲しくない -> I don't want my dad to talk about the good old days."
    },
    {
      "title": "Adjective + する",
      "description": "To make something be 'adjective'",
      "example": "１）安くしてくれない？ -> Can't you make this cheaper?\n２）しずかにしてください -> Please keep quiet"
    },
    {
      "title": "〜てあります",
      "description": "Situtations that are brought about on purpose\nUses Transitive verbs\nThe counterpart to 〜ておく",
      "example": "寒いので，窓まどが閉めてあります -> Because it is cold, the window has been kept closed."
    },
    {
      "title": "Passive Form",
      "description": "(Victim) は (Villian) に (Action)\nDoesn't always have to be negative, but usually\nChange to 〜あれる ending",
      "example": "私は彼女にふられた -> I was dumped by my girlfriend."
    },
    {
      "title": "〜やすい／〜にくい",
      "description": "Easy to do/Hard to do\nSubjective/personal, not objective\nAlways use は as the particle!\nStem + やすい／にくい",
      "example": "このゲッムはやりやすい -> This game is easy to play"
    },
    {
      "title": "name という item",
      "description": "A person or thing that goes by a certain name.",
      "example": "「花」と言う歌を知っているか？ -> Do you know the some called 'hana'?"
    },
    {
      "title": "Embedded Questions",
      "description": "If no question word in clause, end with: かどうか",
      "example": "旅行に行くかどうかまだ決めていません -> We haven't decided if we'll go on a vacation or not yet."
    },
    {
      "title": "〜ないで (without)",
      "description": "To do something without something else",
      "example": "字書を使わないで，新聞を読めます -> I can read the newspaper without a dictionary"
    },
    {
      "title": "Humble Expressions",
      "description": "To speak humbly of things you do with others.\nお + Stem + する (I humbly do)",
      "example": "昨日，先生にお会いしました -> Yesterday, I (humbly) met with the professor."
    },
    {
      "title": "Extra-Modest Expressions",
      "description": "Used to speak humbly about yourself.\nJust a lot of different verb forms",
      "example": "いる -> おります\n行く／くる -> まいります\nする -> いたします"
    },
    {
      "title": "はずです",
      "description": "Something is 'supposed' to happen.\nNot because of duty/obligation, just that it should or ought to be the case.",
      "example": "日曜日だから，銀行は閉まっているはずです -> Because it is Sunday, the band should be closed."
    },
    {
      "title": "〜てよかったです",
      "description": "Used to say you're 'glad' for something.\nWorks with 〜て form and negative 〜て form.",
      "example": "日本ごを勉強してよかったです -> I'm glad that I've studied Japanese."
    },
    {
      "title": "〜てくれてありがとう",
      "description": "Thanking for specific actions.\nHonorific Version: 〜てくださってありがとうございました",
      "example": "手伝ってくれてありがとう -> Thank you for helping me out."
    },
    {
      "title": "Giving Respectful Advice",
      "description": "Action suggested should be for the other person's benefit.\nお + Verb Stem + ください",
      "example": "お取りください -> Please take this.\nごちゅういください -> Please watch out."
    },
    {
      "title": "Honorific Verbs",
      "description": "Used when speaking of the actions of somebody else higher than you.",
      "example": "いく／くる／いる -> いらっしゃる\nいう -> おっしゃる\nする -> なさる\nくれる -> くださる\nねる -> おやすみになる"
    },
    {
      "title": "〜ばよかった",
      "description": "'I wish I had done', or 'I should have done'.\nUses the 〜えば or 〜れば ending.\nIn the negative, use 〜なければ",
      "example": "この肉を食べなければよかったです -> I shouldn't have eaten that meat."
    },
    {
      "title": "〜ながら",
      "description": "Actions performed at the same time.  Follows the verb stem.",
      "example": "アルバイトをしながら学校に行くのは大変ですね -> It's not easy going to school and working part time."
    },
    {
      "title": "A と B",
      "description": "Whenever A, B as well.\nB clause determines the tense of the sentence.\nA is always in the present tense.\nMust be something that's ALWAYS the case!",
      "example": "秋が来ると葉っぱが落ちる -> When fall comes, the leaves fall."
    },
    {
      "title": "〜てしまう／〜ちゃう",
      "description": "Carried out to completion, or a sense of lack of prediction or control.  Also can convey a sense of regret.",
      "example": "電車にかばんを忘れてしまいました -> I forgot my bag on the train."
    },
    {
      "title": "Intransitive Verbs",
      "description": "Indicate a changed state.\nあく／こわれる／よごれる／つく／etc.",
      "example": "電気がつきました -> The light went on. (vs I TURNED the light on)"
    },
    {
      "title": "〜まえに／〜てから",
      "description": "Before and after.\nVerb A (short present) + まえに + Verb B\nVerb A + てから + Verb B",
      "example": "けんさんが来てから食べましょうか -> Why dont' we eat after Ken has arrived?"
    },
    {
      "title": "〜みたいです",
      "description": "Something or somebody resembles something.\nCan also follow verbs to say it looks like something has happened/is happening.",
      "example": "１）あの人はゴリラみたいです -> That person looks like a gorilla.\n２）あめがふったみたいです"
    },
    {
      "title": "なくてもいいです",
      "description": "It's okay to not do something.",
      "example": "プレセントは高くなくてもいいです -> The present doesn't have to be anything expensive."
    },
    {
      "title": "〜たら",
      "description": "A たら B => B if and when A.\nFollows the short term past of verbs.\nOnly works in the forward direction, B can't come before A.\nCan also be used for hypotheticals.",
      "example": "今晩うちに帰ったら，電話します -> I will call you when I get home tonight."
    },
    {
      "title": "〜って",
      "description": "Used for reporting what people say.\nLike a short form for 〜と言っていました",
      "example": "あきらさんはなんって言っていた -> What did Akira say?"
    },
    {
      "title": "〜そうです　(heard)",
      "description": "Used to report what you've heard.\n*Keep the full ending for adjectives, as opposed to 'looks like'",
      "example": "１）日本ごのじゅぎょうはたのしいそうです -> I hear that their Japanese class is fun.\n２）けいさつによると，まちがきけんだそうです -> According to the police, that town is dangerous."
    },
    {
      "title": "〜てすみませんでした",
      "description": "Apologizing for specifc actions.\nTo apologize for something you didnt' do, use 〜なくて",
      "example": "もっと早く言わなくてすみませんでした -> I'm sorry for not telling you sooner."
    },
    {
      "title": "〜時",
      "description": "Clause A 時 Clause B.\nClause B is the big key player here, determines the final tense.",
      "example": "中国に行った時，おみやげを買います -> I will buy a souveneir when I go to China."
    },
    {
      "title": "〜といい",
      "description": "You hope something (good) will happen.\nOnly use for things that you don't have control over.",
      "example": "雨が降らないといいね -> I hope that it doesn't rain."
    },
    {
      "title": "〜てくれない／ください／いただけませんか",
      "description": "Making Requests.\nCarries varying levels of politeness.",
      "example": "この本を訳してくれませんか？ -> Could you translate this book for me?"
    },
    {
      "title": "〜てあげる／くれる／もらう",
      "description": "Helping verbs.\nDoing things for others/others for you.",
      "example": "友達が宿題を手伝ってくれた -> My friend helped me with my homework."
    },
    {
      "title": "Sentence Qualified Nouns",
      "description": "Using whole clauses to qualify nouns.",
      "example": "机の上にある本が青いです -> The book that is on the desk is blue."
    },
    {
      "title": "〜ておく",
      "description": "Indicates that something is done in preparation for something.",
      "example": "友達が来るから，部屋を掃除しておかなきゃ -> I have to clean my room because friends are coming over."
    },
    {
      "title": "Volitional + とおもっています",
      "description": "Communicates that you've decided to do something.\nWith just 〜とおもいます，　communicates that the decision was made on the spot.",
      "example": "毎日に三時間日本語を勉強しようと思っています -> I've decided to study Japanese for 3 hours everyday."
    },
    {
      "title": "Volitional Form",
      "description": "Less formal version of 〜ましょう",
      "example": "美術館に行こうか -> Shall we go to the art museum?"
    },
    {
      "title": "Noun + しか + Negative",
      "description": "How to say 'only' something.\nCan also use も + positive to say 'as many as'",
      "example": "学校に私しかいない -> I'm the only one at school."
    },
    {
      "title": "〜たらどうですか",
      "description": "Conveys advice or recommendation.\nUsually used after people come to you for advice, not unsolicited.",
      "example": "もっと歯を磨いたらどうですか -> Why not brush your teeth more?"
    },
    {
      "title": "あげる／くれる／もらう",
      "description": "あげる is for YOU going to OTHERS.\nくれる is for OTHERS going to YOU or OTHERS.\n(giver) は／が (reciever) に あげる／くれる",
      "example": "私は私の妹に私の日本語の本をあげた -> I gave my little sister my Japanese book."
    },
    {
      "title": "〜かもしれません",
      "description": "Something will possibly be the case.  Something 'might' happen.\nComes afer the short form of predicates.",
      "example": "明日は雨が降るかもしれません -> It may rain tomorrow."
    },
    {
      "title": "ほしい",
      "description": "'To want' something.  Works like an い-Adjective.",
      "example": "いい漢字の字書が欲しいです -> I want a good kanji dictionary."
    },
    {
      "title": "Period に Frequency",
      "description": "X times per Y",
      "example": "一週間に毎日日本語を勉強します -> I study Japanese every day of the week."
    },
    {
      "title": "なら",
      "description": "Contradiction: Yes __, but __.\nLimitation: Yes, only if __.",
      "example": "たこ焼きなら食べたことがあるが，寿司を食べたことがない -> If it's takoyaki yes, otherwise I haven't eaten sushi."
    },
    {
      "title": "〜てみる",
      "description": "Trying something out, giving it a whirl.",
      "example": "日本に行く時，色々な食べ物を食べてみたい -> I want to try lots of kinds of food when I go to Japan."
    },
    {
      "title": "〜そうです　(seems)",
      "description": "Added to the end of い／な adjectives to say something 'seems' that way.\nDrop the final い or drop the な",
      "example": "１）このリンゴは美味しそうです -> This apple looks delicious!\n２）今日は天気がよさそうです -> The weather looks good today."
    },
    {
      "title": "〜し",
      "description": "A list of reasons for things.\n(Reason 1) し (Reason 2)し, (Situation)",
      "example": "今日，山下先生が来なかった．眠いし，子供がいるし，寝坊しちゃたと言っていた -> Mr. Yamashita didn't come today.  Due to his children and being tired, he overslept, he said."
    },
    {
      "title": "Potential Form",
      "description": "Can do, or able to do.\nる-Verbs => られる\nう-Verbs => える ending\nIf it's a する compound, change particle to が",
      "example": "私は日本語が話せる -> I can speak Japanese."
    },
    {
      "title": "〜なければいけません",
      "description": "You need to do something, or it's necessary to do something.\nLots of different variants.\nFollows the short negative form of a verb.",
      "example": "学校に行かなければいけません -> I need to go to school."
    },
    {
      "title": "ので",
      "description": "Reason-Situation sentences.\nWhen following a な-Adjective or Noun, precede with な",
      "example": "１）勉強しなかったので，成績が悪いです -> Because I didn't study, my grades are bad.\n２）その人はい意地悪なので，嫌いです -> Because that person is mean, I don't like them."
    },
    {
      "title": "〜ほうがいいです",
      "description": "Giving Advice.\nPositive uses short PAST.\nNegative uses short PRESENT.",
      "example": "１）もっと勉強したほうがいいです -> I should study more.\n２）その肉を食べないほうがよかったです -> I shouldn't have eaten that meat."
    },
    {
      "title": "すぎる",
      "description": "Too much, to excess!\nCan be used with verbs or adjectives.\nVerbs go to て-Form, Adjectives drop ending.",
      "example": "１）食べすぎてはいけません -> You must not eat too much.\n２）先の車は早すぎた！ -> That car just now was too fast!"
    },
    {
      "title": "〜ことがある",
      "description": "You have done/experienced something.\nPast informal + ことがある",
      "example": "そのレストランに行ったことがない -> I've never been to that restaurant."
    },
    {
      "title": "〜たり．．．たりする",
      "description": "A way to give a list of activities.\nPlain past + り.\n'I will do/did such things as...'",
      "example": "旅行に，読んだり，勉強したり，ゲッムをしたりしました -> On my vacation, I read, studied, and played games."
    },
    {
      "title": "〜たい",
      "description": "For when you want to do something.\nConjugates just like an い-Adjective.",
      "example": "こどもの時宇宙人に会いたかった -> When I was a child, I wanted to meet aliens."
    },
    {
      "title": "なる",
      "description": "Becoming [Adj] or [Noun]",
      "example": "１）高くなる -> To become tall.\n２）静かになる -> To become quiet.\n３）弁護士になる"
    },
    {
      "title": "つもり",
      "description": "Used to say things you're planning to do.\nVerb in question in in the dictionary form.\nCan also negate the verb for 'not planning to do'.",
      "example": "映画を見るつもりです -> I plan to watch a movie."
    },
    {
      "title": "のほうが／より",
      "description": "Used to compare items.\nComparing Multiple: A と B と， どちらのほうが．．．\nA のほうが B より (propery) => A is more (property) than B.",
      "example": "中国のほうが日本より大きいです -> China is larger than Japan."
    },
    {
      "title": "Qualifying Nouns with Verbs and Adjectives",
      "description": "Like adding a mini clause before your noun to describe it in some way.",
      "example": "１）昨日買った本を無くしちゃった -> I've lost the book I bought yesterday.\n２）そこの猫が好きな人はみちこさんです -> The person who likes cats over there is Michiko."
    },
    {
      "title": "まだ．．．〜ていません",
      "description": "Have not... yet",
      "example": "１）私はまだ昼ご飯を食べていません -> I haven't eaten lunch yet.\n２）ゆきさんはまだ見ていません -> Yuki hasn't seen it yet."
    },
    {
      "title": "To be good or bad at something",
      "description": "Use the infinitve form + のが〜",
      "example": "１）私は日本語を喋るのが上手です -> I am good at speaking in Japanese.\n２）私は俳句を書くのが下手です -> I am not good at writing haiku."
    },
    {
      "title": "Verb のがすきです／きらいです",
      "description": "To like or dislike something.\nUse the infinitive form + のが〜",
      "example": "１）私は泳ぐのが好きです -> I like to swim.\n２）私は部屋を掃除するのが嫌いです -> I don't like cleaning my room."
    },
    {
      "title": "〜ないでください",
      "description": "Asking someone not to do something.",
      "example": "１）ここでピザを食べないでください -> Please don't eat pizza here.\n２）どこにも行かないでください -> Please don't go anywhere."
    },
    {
      "title": "〜ていっていました",
      "description": "Used for quoting exact phrases or utterances.",
      "example": "来週の金曜日にテストがあると言っていました -> She said that there is a test next Friday."
    },
    {
      "title": "〜とおもいます",
      "description": "Used to describe when you think that something is the case.\nTo say you DON'T think something is the case, negate the CLAUSE.",
      "example": "１）たけしさんはメアリさんが好きだと思います -> I think that Takeshi likes Mary.\n２）その人は高くないと思います -> I think that person is no tall."
    },
    {
      "title": "Stem + に行く",
      "description": "'Going' to fulfill some action or purpose.\nAlways indicates some destination, even if just implied.",
      "example": "明日，新しい眼鏡を買いに行きます -> Tomorrow I'm going to buy some new glasses."
    },
    {
      "title": "〜てはいけません",
      "description": "You must not do...",
      "example": "ここで写真を撮ってはいけません -> You must not take pictures here."
    },
    {
      "title": "〜てもいいです",
      "description": "You may do.  It's alright if...\nCan also be used in question form to ask permission.",
      "example": "１）食べてもいいですか？ -> May I eat this?\n２）今，写真を撮ってもいいです -> You can take the picture now."
    }
  ]
}